:PROPERTIES:
:ID:       57607f58-32d2-4e2b-9327-551164929fa7
:END:
#+TITLE: VyOS: Setting Up Firewall Rules
#+CATEGORY: slips
#+TAGS:

Skip to [[#Routing]] if emacs is irrelevant.

#+begin_quote
Note: config details like addresses are are swapped around, but should be
internally consistent
#+end_quote

This covers setting up DNS, NTP and basic firewall groups, but doesn't get into
setting up the ipv4 chains: input, forward, output, pre-routing

I don't think I will use zones, but instead custom chains to avoid most of the
wild rule sequencing.

The router is conveniently unplugged until it actually um has a firewall lol

** R2

shell in operation mode

#+name: *r2ops*
#+begin_src shell :session *r2ops* :results output silent
ssh r2
# vbash
# source /opt/vyatta/etc/functions/script-template
#+end_src

shell in =configure= mode

#+name: *r2conf*
#+begin_src shell :session *r2conf* :results output silent
ssh r2
# vbash
# source /opt/vyatta/etc/functions/script-template
configure
#+end_src

check =configure= status

#+begin_src shell :session *r2conf* :results output code :wrap example diff
compare | cat -v
#+end_src

#+RESULTS:
#+begin_example diff
No changes between working and active configurations.

[edit]
#+end_example

** Commands

On =r2=

#+begin_src shell :session *r2ops* :results output code :wrap example diff
ss -4t | grep ssh
#+end_src

#+RESULTS:
#+begin_example diff
ESTAB 0      0         172.16.180.102:ssh    172.16.180.73:57298
ESTAB 0      0         172.16.180.102:ssh    172.16.180.73:35572
ESTAB 0      0         172.16.180.102:ssh    172.16.180.73:45018
#+end_example

**** Flexibility

VyOS allows for rules between =1-999999= so I'd like to break this up into an
"address space" that offers efficiency, some mnemonics, but also future
flexibility

#+name: logloglog
|      n | log(n) |      n | log(n) |      n | log(n) |
|--------+--------+--------+--------+--------+--------|
| 000001 |   0.00 | 000100 |   2.00 | 010000 |   4.00 |
| 000003 |   0.48 | 000316 |   2.50 | 031623 |   4.50 |
| 000005 |   0.70 | 000500 |   2.70 | 050000 |   4.70 |
| 000010 |   1.00 | 000632 |   2.80 | 063246 |   4.80 |
| 000031 |   1.49 | 001000 |   3.00 | 100000 |   5.00 |
| 000050 |   1.70 | 003162 |   3.50 | 316224 |   5.50 |
| 000063 |   1.80 | 005000 |   3.70 | 500000 |   5.70 |
#+tblfm: $2=log($1,10);%.2f
#+tblfm: $4=log($3,10);%.2f
#+tblfm: $6=log($5,10);%.2f

